html/20231125T235251--api-tools__api.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>api tools</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231125T235251--api-tools__api.html">api tools</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb2b0d0b">1. K ismintis apie API ir restapi</a></li>
<li><a href="#orgd37cc80">2. Tools</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgb2b0d0b" class="outline-2">
<h2 id="orgb2b0d0b"><span class="section-number-2">1.</span> K ismintis apie API ir restapi</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
dabar kyla naujas dalykas - GraphQL, bet nežinau, ar jis pilnai pakeis REST,
gal tik eis šalia, ir vienur bus vienas, kitur kitas naudojamas
</p>

<p>
kitas dalykas - REST API paslepia duomenų bazę ir Backend logic. Tai nors su
kai kuriomis DB galima rašyti backend logic irgi, pavyzdžiui su Oracle,
naudojant jų PL/SQL programavimo kalbą, dažnai kalbą nori rinktis pagal kitus
kriterijus
</p>

<p>
taip pat dėl saugumo, kodas, kuris yra už REST API paslepia visokius
slaptažodžius, keys. Tarkim, jei turi frontend framework iš kurio jungiesi į
DB, tai tu negali ten įdėt duomenų bazęs prisijungimų
</p>

<p>
nes tai iš karto nesaugu
</p>

<p>
tu tikrai nenori, kad kiekvienas tavo vartotojas būtų ir duomenų bazės
vartotojas
</p>

<p>
taigi, taip apibendrintai, tai dėl patogumo ir saugumo
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgd37cc80" class="outline-2">
<h2 id="orgd37cc80"><span class="section-number-2">2.</span> Tools</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://fakestoreapi.com/">fakestoreapi.com</a></li>
<li><a href="https://api.vilnius.lt/">https://api.vilnius.lt/</a></li>
<li><a href="https://data.gov.lt/public/api/1">https://data.gov.lt/public/api/1</a></li>
<li><a href="https://github.com/public-apis/public-apis">https://github.com/public-apis/public-apis</a></li>
<li><a href="https://www.programmableweb.com/">lots of free apis</a></li>
<li><a href="https://www.youtube.com/watch?v=7YcW25PHnAA&amp;ab_channel=WebConcepts">api example facebook/instagram/twitter</a></li>
<li><a href="https://hoppscotch.io/">https://hoppscotch.io/</a></li>
<li><a href="https://www.postman.com/">https://www.postman.com/</a></li>
<li>thunder client <a href="20231125T181008--vscode__vscode.html">vscode</a></li>
</ul>
</div>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-api.html">api</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
